
import numpy as np
import pandas as pd

class Fluid:
    def __init__(self, M: float, rho_c: float, xa: float, xy: float, T: float, file_PVT: pd):
        """
        Задание параметров флюида

        Параметры
        ----------
        M [кг/кмоль] - молярная масса
        rho_c [кг/м³] - плотность при стандартных условиях
        xa [%] - Мольная доля азота (N₂).
        xy [%] - Мольная доля диоксида углерода (CO₂).
        T [К] - температура системы, задаётся один раз
        """
        
        # T [К] — температура системы, задаётся один раз
        self.M = M
        self.rho_c = rho_c
        self.xa = xa/100 # Перевод в доли.ед.
        self.xy = xy/100 # Перевод в доли.ед.
        self.T = T
        self.file_PVT = file_PVT

    def get_z(self, P: float) -> float:
        """
        Рассчитать коэффициент сверхсжимаемости Z по методике GERG-91 мод.

        Параметры
        ----------
        P : float
            Давление, атм.

        Возвращает
        ----------
        float
            Коэффициент сверхсжимаемости Z.
        """
        P = P/9.8692327 # Перевод атм в МПа

        # Мешает в дебаге
        # # Блок проверки на условия применимости
        # T = self.T # К
        # if not(self.rho_c > 0.668 and self.rho_c < 0.700):
        #     print(f'Attention - плотность газа в не диапазона 0.668 < ro < 0.700 кг/м3, ro:{self.rho_c}')
        # if not(T > 250 and T < 330):
        #     print(f'Attention - температура газа в не диапазона 250 < T < 340 K, K:{T}')
        # if not(P > 0 and P < 12):
        #     if P > 0 and P < 30:
        #         print(f'Attention - давление газа в не диапазона 0 < P < 12 МПа, P:{P}, погрешность расчёта +/- 3,0%')
        #     else:
        #         print(f'Attention - давление газа в не диапазона 0 < P < 30 МПа, P:{P}')

        T = self.T # К
        xa = self.xa # дол.ед, азот
        xy = self.xy # дол.ед, диоксид углерода
        rho_c = self.rho_c # кг/м³, плотность при стандартных условиях

        xe = 1 - xa - xy # дол.ед, эквивалент углеводорода
        zc = 1-(0.0741*rho_c-0.006-0.063*xa-0.0575*xy)**2 # дол.ед, Фактор сжимаемости при стандартных условиях
        Me = (24.05525*zc*rho_c-28.0135*xa-44.01*xy)/xe # г/моль, Молярная масса эквивалетного углеводорода

        H = 128.64 + 47.479 * Me
        Cx = 0.92 + 0.0013 * (T - 270)
        Bx = 0.72 + 1.875*10**-5 * (320 - T)**2

        C233 = 3.58783*10**-3 + 8.06674*10**-6 * T - 3.25798*10**-8 * T**2
        C223 = 5.52066*10**-3 - 1.68609*10**-5 * T + 1.57169*10**-8 * T**2

        C3 = 2.0513*10**-3 + 3.4888*10**-5*T - 8.3703*10**-8 * T**2
        C2 = 7.8498*10**-3 - 3.9895*10**-5*T + 6.1187*10**-8 * T**2
        C1 = (-0.302488 + 1.95861*10**-3*T - 3.16302*10**-6 * T**2
              + (6.46422*10**-4 - 4.22876*10**-6*T + 6.88157*10**-9*T**2) * H
              + (-3.32805*10**-7 + 2.2316*10**-9*T - 3.67713*10**-12*T**2) * H**2)

        B3 = -0.86834 + 4.0376 * 10**-3 * T - 5.1657 * 10**-6 * T**2
        B23 = -0.339693 + 1.61176 * 10**-3 * T - 2.04429 * 10**-6 * T**2
        B2 = -0.1446 + 7.4091 * 10**-4 * T - 9.1195 * 10**-7 * T**2
        B1 = (-0.425468 + 2.865e-3 * T - 4.62073e-6 * T ** 2
               + (8.77118e-4 - 5.56281e-6 * T + 8.8151e-9 * T ** 2) * H
               + (-8.24747e-7 + 4.31436e-9 * T - 6.08319e-12 * T ** 2) * H ** 2)

        Cm = (xe**3 * C1 + 3 * xe**2 * xa * Cx * (C1**2 * C2)**(1/3) + 2.76 * xe**2 * xy * (C1**2 * C3)**(1/3)
              + 3 *xe*xa**2*Cx*(C1*C2**2)**(1/3) + 6.6*xe*xa*xy*(C1 * C2 * C3)**(1/3) + 2.76 * xe * xy**2 * (C1 * C3**2)**(1/3)
              + xa**3* C2 + 3 *xa**2 * xy*C223 + 3 * xa*xy**2*C233 + xy**3 * C3)

        Bm = (xe**2*B1 + xe*xa*Bx*(B1+B2)-1.73*xe*xy*(B1*B3)**0.5
              +xa**2*B2+2*xa*xy*B23+xy**2*B3)

        # GERG-91 mod, P в МПа
        b = 10**3 * (P / (2.7715*T))
        C0 = b**2 * Cm
        B0 = b * Bm
        A1 = 1 + B0
        A0 = 1 + 1.5 * (B0 + C0)
        A2 = (A0 - (A0**2 - A1**3)**0.5)**(1/3)

        Z = (1 + A2 + A1/A2) / 3

        if np.iscomplex(Z):
            print(f'Значение Z принимает нефизичные значения при P={P} и T={T}, return: 1.0')
            return 1
        return Z

    def get_bg(self, P: float) -> float:
        """
        Расчёт объёмного коэффициента газа Bg.
        ----------
        Bg = (Pstd * Z * T) / (P * Tstd)

        Параметры
        ----------
        P : float 
            Давление, атм.

        Возвращает
        ----------
        float
            Объёмный коэффициент расширения Bg, м³/м³.
        """

        T = self.T # К
        Pstd = 1 # атм, давление при стандартных условиях
        Tstd = 293.15 # К, температура при стандартных условиях

        Bg = (Pstd * self.get_z(P) * T) / (P * Tstd)
        return Bg

    def get_ro(self, P: float) -> float:      # плотность [кг/м³]
        """
        Расчёт плотости газа ro.
        ----------
        ro = P*M/(Z*R*T)

        Параметры
        ----------
        P : float
            Давление, атм.

        Возвращает
        ----------
        float
            Плотность газа, кг/м³.
        """
        # ro = rho_c / self.get_bg(P) # кг/м³, возможен расчёт через объёмный коэффициент расширения
        ro = (P*101325*self.M*10**-3)/(self.get_z(P)*8.314462618*self.T)

        return ro

    def get_mu(self, P: float, T: float = 293.15) -> float:      # вязкость [сП]
        """
        Расчёт вязкости газа от Р

        Параметры
        ----------
        P : float
            Давление, атм.
        T : float # Пока не используется
            Температура, К.
        Возвращает
        ----------
        float
            Вязкость газа, сП.
        """
        file_PVT = self.file_PVT

        return np.interp(P, file_PVT['pressure, atm'], file_PVT['viscosity, cP'])

    # остальные методы — на усмотрение студента
